# Advanced Combine Operations

In [32]:
import pandas as pd

### 1-1 Join

In [33]:
df1 = pd.DataFrame({"workers": ["Jack", "John", "Lisa", "Roy"],
                   "job": ["Engineer", "Soldier", "Receptionist", "Programmer"]
                   })

In [34]:
df1

  workers           job
0    Jack      Engineer
1    John       Soldier
2    Lisa  Receptionist
3     Roy    Programmer

In [35]:
df2 = pd.DataFrame({"workers": ["John", "Lisa", "Jack", "Roy"],
                   "cars": ["BMW", "Mercedes", "Ford Mustang", "Lamborghini"]
                   })

In [36]:
df2

  workers          cars
0    John           BMW
1    Lisa      Mercedes
2    Jack  Ford Mustang
3     Roy   Lamborghini

In [37]:
pd.merge(df1, df2)

  workers           job          cars
0    Jack      Engineer  Ford Mustang
1    John       Soldier           BMW
2    Lisa  Receptionist      Mercedes
3     Roy    Programmer   Lamborghini

In [38]:
pd.merge(df1, df2, on = "workers")

  workers           job          cars
0    Jack      Engineer  Ford Mustang
1    John       Soldier           BMW
2    Lisa  Receptionist      Mercedes
3     Roy    Programmer   Lamborghini

### Many to One Join

In [39]:
df3 = pd.merge(df1, df2)

In [40]:
df4 = pd.DataFrame({
    'job': ['Engineer', 'Soldier', 'Receptionist'],
    'headmaster': ['Ray', 'Wilson', 'Layla']

})

In [41]:
df4

            job headmaster
0      Engineer        Ray
1       Soldier     Wilson
2  Receptionist      Layla

In [42]:
pd.merge(df3, df4)

  workers           job          cars headmaster
0    Jack      Engineer  Ford Mustang        Ray
1    John       Soldier           BMW     Wilson
2    Lisa  Receptionist      Mercedes      Layla

### Many to Many Join

In [43]:
df5 = pd.DataFrame({
    'job': ['Engineer', 'Engineer', 'Soldier', 'Receptionist', 'HR'],
    'skills': ['Maths', 'Physics', 'Weapon Using', 'Communcation', 'Commit']
})

In [44]:
df5

            job        skills
0      Engineer         Maths
1      Engineer       Physics
2       Soldier  Weapon Using
3  Receptionist  Communcation
4            HR        Commit

In [45]:
df1

  workers           job
0    Jack      Engineer
1    John       Soldier
2    Lisa  Receptionist
3     Roy    Programmer

In [46]:
pd.merge(df1, df5)

  workers           job        skills
0    Jack      Engineer         Maths
1    Jack      Engineer       Physics
2    John       Soldier  Weapon Using
3    Lisa  Receptionist  Communcation